<?php

//WebSocket广播系统的服务器地址，默认为服务器的IP
$WSSERVER	=	($_SERVER['SERVER_ADDR']=="::1")?"127.0.0.1":$_SERVER['SERVER_ADDR'];


/********************************
学生作业保存路径和自动备份控制
*********************************/
$student_works="student_works/";

$site_path="/scratch3.0_for_class/";		//Scratch3.0的editor文件夹所在路径
                                                //这个请使用WEB目录中从根目录开始的绝对路径。


$delete_after_saving=0;				//1:执行“上传文件到服务器”后，删除备份文件。
$max_backup_file=99;				//0:无限制



/********************************

班级信息设置

列举出所有班级。

*********************************/
$classname=Array("三（1）班","三（2）班","三（3）班","三（4）班","三（5）班","三（6）班","三（7）班","三（8）班","三（9）班",		  
                 "四（1）班","四（2）班","四（3）班","四（4）班","四（5）班","四（6）班","四（7）班","四（8）班","四（9）班","四（10）班",
                 "五（1）班","五（2）班","五（3）班","五（4）班","五（5）班","五（6）班","五（7）班","五（8）班",			  
		 "六（1）班","六（2）班","六（3）班","六（4）班","六（5）班","六（6）班",				    		  
		 "兴趣班","Scratch比赛","公开课"); 											  

$cc=count($classname);//班级总数量。

//班级所对应的年级
$grades=Array(  
                3,3,3,3,3,3,3,3,3,	//9
                4,4,4,4,4,4,4,4,4,4,	//10
		5,5,5,5,5,5,5,5,	//8
		6,6,6,6,6,6,		//6
		7,8,6);			//3	//班级所对应的年级。这里，我把兴趣班标记为7，Scratch比赛标记为8。有初中部的需要适当延后。


//班级所对应的机房
//这个是单独给机房用的，非公网。
$rooms=Array(  
                1,1,1,1,1,1,1,1,1,	//9
                2,2,2,2,2,2,2,2,2,2,	//10
		5,5,5,5,5,5,5,5,	//8
		6,6,6,6,6,6,		//6
		7,8,6);			//3	//班级所对应的年级。这里，我把兴趣班标记为7，Scratch比赛标记为8。有初中部的需要适当延后。



//机房的IP段所对应的班级
$class_room=Array(
   9=>Array(36),//公开课
   2=>Array(36),//公开课
   1=>Array(1,2,3,4,5,6,7,8,9,28,29,30,31,32,33),//兴趣班34
   2=>Array(20,21,22,23,24,25,26,27),
   3=>Array(10,11,12,13,14,15,16,17,18,19),
);


//登录表单中显示的班级
$classroom_list=Array( 1,2,3,4,5,6,7,8);




/********************************
教师机设置

设置固定的IP，目的是当预设IP访问网站时，可以自动识别身份，实现自动登录。
前提：一个教室内的电脑应该在同一网段，不同教室，网段不同。

*********************************/
$teacher_room=Array(				//教师机IP与教室的对应情况。
   "192.168.3.9"	=>	Array("吴老师",1),	//教室讲台IP
   "192.168.10.112"	=>	Array("吴老师",1),	//办公室IP
   "127.0.0.1"		=>	Array("吴老师",1),	//IPv4本地
   "::1"		=>	Array("吴老师",1),	//IPv6本地

   "192.168.4.10"	=>	Array("矫老师",2),	//姓名，教室编号
   "192.168.10.113"	=>	Array("矫老师",2),

   "192.168.5.10"	=>	Array("陈老师",3),
   "192.168.10.8"	=>	Array("陈老师",3),

   "192.168.1.102"	=>	Array("吴老师",1),
   $_SERVER['SERVER_ADDR'] =>   Array("吴老师",1)
);

//学生机IP段与机房匹配设置
$student_room=Array(				//学生机IP段（x.x.IP段.x）与教室的对应情况
   "0"	=>	Array(1,0),			//教室编号，第一台学生机IP（192.168.3.11）
   "1"	=>	Array(1,0),			//教室编号，第一台学生机IP（192.168.3.11）
   "10"	=>	Array(1,0),			//教室编号，第一台学生机IP（192.168.3.11）
   "3"	=>	Array(1,0),			//教室编号，第一台学生机IP（192.168.3.11）
   "4"	=>	Array(2,10),			//教室编号，第一台学生机IP（192.168.4.11）
   "5"	=>	Array(3,10),			//教室编号，第一台学生机IP（192.168.5.10）
);

//机房与教师匹配设置
$teacher_name=Array( //教室与教师对应
   "1"=>"吴老师",
   "2"=>"矫老师",
   "3"=>"陈老师"
);


//机房与教师匹配设置
$teachername_room=Array( //教室与教师对应
   "吴老师"=>1,
   "矫老师"=>2,
   "陈老师"=>3
);


/********************************
Scratch开设年级
*********************************/
$scratch_grade=Array(
   7=>1,
   6=>1,
   5=>1,
   4=>1,
   3=>1,
   8=>1,
   9=>1
);

//教师任课班级
$scratch_class=Array(
   "吴老师"=>Array(0,1,2,3,4,5,6,7,8,27,28,29,30,31,32,33,35),//35公开课
   "矫老师"=>Array(19,20,21,21,23,24,25,26),
   "陈老师"=>Array(10,11,12,13,14,15,16,17,18)
);
/********************************
作息时间配置
*********************************/
$time_offset=Array(Array("08","20","09","00"),//每节课时间预设  格式：（开始时，开始分，结束时，结束分）
		   Array("09","30","10","15"),
		   Array("10","25","11","05"),
		   Array("11","15","11","55"),
		   Array("13","40","14","25"),
		   Array("14","35","15","15"),
		   Array("15","20","16","25"));

/////////////////////////////////////////////////////////////////////////////////////////////////////
//以上为需要修改的数据。
/////////////////////////////////////////////////////////////////////////////////////////////////////

/*********************************************
输入年、周、日后得到具体日期
*********************************************/
function weekday($year,$week,$day){

   $year_start = mktime(0,0,0,1,1,$year);   
   $year_end = mktime(0,0,0,12,31,$year);   

   if (intval(date('W',$year_start))===1){      	// 判断第一天是否为第一周的开始   
      $start = $year_start;				//把第一天做为第一周的开始   
   }else{   
      $week++;   
      $start = strtotime('+1 monday',$year_start);	//把第一个周一作为开始 
   }

   if ($week===0){      				//第几周的开始时间   
      $weekday = $start;   
   }else{   
      $weekday = strtotime('+'.($week).' monday',$start); //week从1开始的。
   }   
   $weekday+=$day*24*3600;   				//第几周的结束时间
   return  date("Y-m-d",$weekday);
}

/*****************************************
获取目录下所有文件
*****************************************/
function getfilelist($dir)
{
   global $datedir,$student_works;
   $add=$student_works."/".$dir."/".$datedir;
   //echo $add;
   $filelist="";
   if ($handle = @opendir($add))
   {
      while (false !== ($file = @readdir($handle)))
      {
         $filelist.= $file;
      }
      closedir($handle); 
   }
   return $filelist;
}

/**************************************
显示某个IP或姓名的个数，也即文件数量。
**************************************/
function showfiles($fileinfo,$ip,$name)
{
   $ip=long2ip($ip);
   $count=preg_match_all("/_".$name."_/",$fileinfo,$m);//根据学生名字匹配
//echo $count;
   if($count==0)
   {
      $count=preg_match_all("/".$ip."_/",$fileinfo,$m);//根据IP匹配。登录超时后，也可以提交作业，但文件名里只有IP地址。
//echo $count;
   }
   return $count>7?7:$count;
}

//过滤文件名中非法字符
function validateFilename($filename)
{
   return str_replace(Array('/','\\',':','*','"','<','>','|','?'),'_',$filename);
}


//过滤聊天中非法字符
function validateMsg($msg)
{
   return str_replace(Array('<script','</script>'),'*',$msg);
}